frontend/controllers/SiteController.php

    public function actionIndex()
    {
        $courses = Course::find()->all();
---
SELECT * FROM `course`